Autodesk.Revit.DB.Structure.RebarLayoutRule
The rule for how the rebars in rebar set are laid out

Autodesk.Revit.DB.Structure.RebarLayoutRule.MinimumClearSpacing
The minimum distance between rebar is specified by input,
and the number of rebar changes based on the length of rebar set.
This spacing is maintained even if the rebar size changes.

Autodesk.Revit.DB.Structure.RebarLayoutRule.NumberWithSpacing
Both the spacing between rebar and the number of rebar are constant based on input.

Autodesk.Revit.DB.Structure.RebarLayoutRule.MaximumSpacing
The maximum distance between rebar is specified by input,
and the number of rebar changes based on the length of rebar set.

Autodesk.Revit.DB.Structure.RebarLayoutRule.FixedNumber
The spacing between the rebar is adjustable,
but the number of bars is constant based on input.

Autodesk.Revit.DB.Structure.RebarLayoutRule.Single
It is a single rebar and not a rebar set.